MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KM204/mcu.h
#define _CCP5STAT_TRCLR_POSITION                 0x00000005
#define _CCP5STAT_TRCLR_MASK                     0x00000020
#define _CCP5STAT_TRCLR_LENGTH                   0x00000001

#define _CCP5STAT_TRSET_POSITION                 0x00000006
#define _CCP5STAT_TRSET_MASK                     0x00000040
#define _CCP5STAT_TRSET_LENGTH                   0x00000001

#define _CCP5STAT_CCPTRIG_POSITION               0x00000007
#define _CCP5STAT_CCPTRIG_MASK                   0x00000080
#define _CCP5STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP5STAT_ICGARM_POSITION                0x0000000A
#define _CCP5STAT_ICGARM_MASK                    0x00000400
#define _CCP5STAT_ICGARM_LENGTH                  0x00000001

#define _CCP5STAT_TRIG_POSITION                  0x00000007
#define _CCP5STAT_TRIG_MASK                      0x00000080
#define _CCP5STAT_TRIG_LENGTH                    0x00000001

#define _CCP5STATL_ICBNE_POSITION                0x00000000
#define _CCP5STATL_ICBNE_MASK                    0x00000001
#define _CCP5STATL_ICBNE_LENGTH                  0x00000001

#define _CCP5STATL_ICOV_POSITION                 0x00000001
#define _CCP5STATL_ICOV_MASK                     0x00000002
#define _CCP5STATL_ICOV_LENGTH                   0x00000001

#define _CCP5STATL_ICDIS_POSITION                0x00000002
#define _CCP5STATL_ICDIS_MASK                    0x00000004
#define _CCP5STATL_ICDIS_LENGTH                  0x00000001

#define _CCP5STATL_SCEVT_POSITION                0x00000003
#define _CCP5STATL_SCEVT_MASK                    0x00000008
#define _CCP5STATL_SCEVT_LENGTH                  0x00000001

#define _CCP5STATL_ASEVT_POSITION                0x00000004
#define _CCP5STATL_ASEVT_MASK                    0x00000010
#define _CCP5STATL_ASEVT_LENGTH                  0x00000001

#define _CCP5STATL_TRCLR_POSITION                0x00000005
#define _CCP5STATL_TRCLR_MASK                    0x00000020
#define _CCP5STATL_TRCLR_LENGTH                  0x00000001

#define _CCP5STATL_TRSET_POSITION                0x00000006
#define _CCP5STATL_TRSET_MASK                    0x00000040
#define _CCP5STATL_TRSET_LENGTH                  0x00000001

#define _CCP5STATL_CCPTRIG_POSITION              0x00000007
#define _CCP5STATL_CCPTRIG_MASK                  0x00000080
#define _CCP5STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP5STATL_ICGARM_POSITION               0x0000000A
#define _CCP5STATL_ICGARM_MASK                   0x00000400
#define _CCP5STATL_ICGARM_LENGTH                 0x00000001

#define _CCP5STATL_TRIG_POSITION                 0x00000007
#define _CCP5STATL_TRIG_MASK                     0x00000080
#define _CCP5STATL_TRIG_LENGTH                   0x00000001

#define _SPI1BUF_SSPBUF_POSITION                 0x00000000
#define _SPI1BUF_SSPBUF_MASK                     0x000000FF
#define _SPI1BUF_SSPBUF_LENGTH                   0x00000008

#define _SPI1BUF_SPI1BUF_POSITION                0x00000000
#define _SPI1BUF_SPI1BUF_MASK                    0x000000FF
#define _SPI1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1BUF_SSPBUF_POSITION                 0x00000000
#define _SSP1BUF_SSPBUF_MASK                     0x000000FF
#define _SSP1BUF_SSPBUF_LENGTH                   0x00000008

#define _SSP1BUF_SPI1BUF_POSITION                0x00000000
#define _SSP1BUF_SPI1BUF_MASK                    0x000000FF
#define _SSP1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1CON1_SSPM_POSITION                  0x00000000
#define _SSP1CON1_SSPM_MASK                      0x0000000F
#define _SSP1CON1_SSPM_LENGTH                    0x00000004

#define _SSP1CON1_CKP_POSITION                   0x00000004
#define _SSP1CON1_CKP_MASK                       0x00000010
#define _SSP1CON1_CKP_LENGTH                     0x00000001

#define _SSP1CON1_SSPEN_POSITION                 0x00000005
#define _SSP1CON1_SSPEN_MASK                     0x00000020
#define _SSP1CON1_SSPEN_LENGTH                   0x00000001

#define _SSP1CON1_SSPOV_POSITION                 0x00000006
#define _SSP1CON1_SSPOV_MASK                     0x00000040
#define _SSP1CON1_SSPOV_LENGTH                   0x00000001

#define _SSP1CON1_WCOL_POSITION                  0x00000007
#define _SSP1CON1_WCOL_MASK                      0x00000080
#define _SSP1CON1_WCOL_LENGTH                    0x00000001

#define _SSP1CON1_SSPM0_POSITION                 0x00000000
#define _SSP1CON1_SSPM0_MASK                     0x00000001
#define _SSP1CON1_SSPM0_LENGTH                   0x00000001

#define _SSP1CON1_SSPM1_POSITION                 0x00000001
#define _SSP1CON1_SSPM1_MASK                     0x00000002
#define _SSP1CON1_SSPM1_LENGTH                   0x00000001

#define _SSP1CON1_SSPM2_POSITION                 0x00000002
#define _SSP1CON1_SSPM2_MASK                     0x00000004
#define _SSP1CON1_SSPM2_LENGTH                   0x00000001

#define _SSP1CON1_SSPM3_POSITION                 0x00000003
#define _SSP1CON1_SSPM3_MASK                     0x00000008
#define _SSP1CON1_SSPM3_LENGTH                   0x00000001

#define _SSP1CON2_SEN_POSITION                   0x00000000
#define _SSP1CON2_SEN_MASK                       0x00000001
#define _SSP1CON2_SEN_LENGTH                     0x00000001

#define _SSP1CON2_RSEN_POSITION                  0x00000001
#define _SSP1CON2_RSEN_MASK                      0x00000002
#define _SSP1CON2_RSEN_LENGTH                    0x00000001

#define _SSP1CON2_PEN_POSITION                   0x00000002
#define _SSP1CON2_PEN_MASK                       0x00000004
#define _SSP1CON2_PEN_LENGTH                     0x00000001

#define _SSP1CON2_RCEN_POSITION                  0x00000003
#define _SSP1CON2_RCEN_MASK                      0x00000008
#define _SSP1CON2_RCEN_LENGTH                    0x00000001

#define _SSP1CON2_ACKEN_POSITION                 0x00000004
#define _SSP1CON2_ACKEN_MASK                     0x00000010
#define _SSP1CON2_ACKEN_LENGTH                   0x00000001

#define _SSP1CON2_ACKDT_POSITION                 0x00000005
#define _SSP1CON2_ACKDT_MASK                     0x00000020
#define _SSP1CON2_ACKDT_LENGTH                   0x00000001

#define _SSP1CON2_ACKSTAT_POSITION               0x00000006
#define _SSP1CON2_ACKSTAT_MASK                   0x00000040
#define _SSP1CON2_ACKSTAT_LENGTH                 0x00000001

#define _SSP1CON2_GCEN_POSITION                  0x00000007
#define _SSP1CON2_GCEN_MASK                      0x00000080
#define _SSP1CON2_GCEN_LENGTH                    0x00000001

